In [308]:
# 시점 컬럼은 datetime으로 변환시켜야 하기 때문에 str(object)여야 한다.
# 시점 이외 컬럼은 회귀분석을 돌려야 하므로 float여야 한다.
# 여기서 전처리한 것은 testdata_temp에 저장된다.
# 이후 transdata 폴더에 들어있던 기존 파일을 백업, 삭제한 뒤 그 자리에 testdata_temp에 있던 걸 가져왔다.

import os
import pandas as pd
import numpy as np

In [309]:
call = pd.read_csv('Call.csv')
interestdiff = pd.read_csv('InterestDiff.csv', encoding='cp949')
vkospi = pd.read_csv('VKOSPI.csv')
tradbal = pd.read_excel('TradeBalance.xlsx')
cpi = pd.read_excel('CPI.xlsx')
ppi = pd.read_csv('PPI.csv', encoding='cp949')
unemploy = pd.read_excel('Unemployment.xlsx')
manuprod = pd.read_excel('ManufactProduct.xlsx')

In [310]:
korp = pd.read_csv('KORP.csv')
usrp = pd.read_csv('USRP.csv', encoding='cp949')

In [311]:
#call = pd.read_csv('Call.csv')
#interestdiff = pd.read_csv('InterestDiff.csv', encoding='cp949')
#vkospi = pd.read_csv('VKOSPI.csv')
#tradbal = pd.read_csv('TradeBalance.csv', encoding='cp949')
#cpi = pd.read_csv('CPI.csv', encoding='cp949')
#ppi = pd.read_csv('PPI.csv', encoding='cp949')
#unemploy = pd.read_csv('Unemployment.csv', encoding='cp949')
#manuprod = pd.read_csv('ManufactProduct.csv', encoding='cp949')
#korp = pd.read_csv('KORP.csv')
#usrp = pd.read_csv('USRP.csv', encoding='cp949')

### InterestDiff

In [312]:
# InterestDiff 컬럼 온점 -> 공백값으로 바꾸기
interestdiff['InterestDiff'] = interestdiff['InterestDiff'].where(interestdiff['InterestDiff']!='.', None)

# InterestDiff 컬럼 자료형 float로 바꾸기
interestdiff['InterestDiff'] = interestdiff['InterestDiff'].astype('float')

In [313]:
interestdiff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6613 entries, 0 to 6612
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   시점            6613 non-null   object
 1   InterestDiff  6343 non-null   float64
dtypes: float64(1), object(1)
memory usage: 103.5+ KB

In [314]:
interestdiff.isna().sum()

시점                0
InterestDiff    270
dtype: int64

### VKOSPI

In [315]:
#VKOSPI 컬럼 '%' 문자 제거
vkospi['VKOSPI'] = vkospi['VKOSPI'].str.slice(start=0, stop=4)
vkospi

              시점 VKOSPI
0     2022-11-09   0.55
1     2022-11-08   -3.9
2     2022-11-07   -0.1
3     2022-11-04   -1.7
4     2022-11-03   0.38
...          ...    ...
2271  2013-08-12   2.36
2272  2013-08-09   -3.8
2273  2013-08-08   -2.5
2274  2013-08-07   2.47
2275  2013-08-06   0.40

[2276 rows x 2 columns]

In [316]:
# VKOSPI 컬럼 자료형 float로 바꾸기
vkospi['VKOSPI'] = vkospi['VKOSPI'].astype('float')

In [317]:
vkospi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2276 entries, 0 to 2275
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   시점      2276 non-null   object
 1   VKOSPI  2276 non-null   float64
dtypes: float64(1), object(1)
memory usage: 35.7+ KB

In [318]:
vkospi.isna().sum()

시점        0
VKOSPI    0
dtype: int64

### TradeBalance

In [319]:
tradbal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 273 entries, 0 to 272
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   시점            273 non-null    object
 1   TradeBalance  273 non-null    int64
dtypes: int64(1), object(1)
memory usage: 4.4+ KB

In [320]:
# TradeBalance 컬럼 자료형 float로 바꾸기
tradbal['TradeBalance'] = tradbal['TradeBalance'].astype('float')

In [321]:
tradbal

          시점  TradeBalance
0    2000-01     -432198.0
1    2000-02      652390.0
2    2000-03      217692.0
3    2000-04      177508.0
4    2000-05     1353399.0
..       ...           ...
268  2022-05    -1605818.0
269  2022-06    -2497006.0
270  2022-07    -5088670.0
271  2022-08    -9393976.0
272  2022-09    -3778132.0

[273 rows x 2 columns]

In [322]:
tradbal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 273 entries, 0 to 272
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   시점            273 non-null    object
 1   TradeBalance  273 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.4+ KB

In [323]:
tradbal.isna().sum()

시점              0
TradeBalance    0
dtype: int64

In [324]:
cpi

          시점      CPI
0    1997-07   56.825
1    1997-08   57.240
2    1997-09   57.502
3    1997-10   57.502
4    1997-11   57.553
..       ...      ...
299  2022-06  108.220
300  2022-07  108.740
301  2022-08  108.620
302  2022-09  108.930
303  2022-10  109.210

[304 rows x 2 columns]

In [325]:
cpi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 304 entries, 0 to 303
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   시점      304 non-null    object
 1   CPI     304 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.9+ KB

In [326]:
cpi.isna().sum()

시점     0
CPI    0
dtype: int64

In [327]:
ppi.isna().sum()

시점     0
PPI    0
dtype: int64

In [328]:
unemploy

          시점  Unemployment
0    1999-06           6.7
1    1999-07           6.7
2    1999-08           6.2
3    1999-09           5.2
4    1999-10           5.0
..       ...           ...
276  2022-06           3.0
277  2022-07           2.9
278  2022-08           2.1
279  2022-09           2.4
280  2022-10           2.4

[281 rows x 2 columns]

In [329]:
unemploy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 281 entries, 0 to 280
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   시점            281 non-null    object
 1   Unemployment  281 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.5+ KB

In [330]:
unemploy.isna().sum()

시점              0
Unemployment    0
dtype: int64

In [331]:
# 시점 컬럼 자료형 str로 바꾸기
manuprod['시점'] = manuprod['시점'].astype('str')

In [332]:
manuprod

          시점  ManufactProduct
0    1997-07           36.206
1    1997-08           35.382
2    1997-09           36.176
3    1997-10           38.745
4    1997-11           37.254
..       ...              ...
298  2022-05          119.900
299  2022-06          118.800
300  2022-07          118.400
301  2022-08          112.200
302  2022-09          112.000

[303 rows x 2 columns]

In [333]:
manuprod.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   시점               303 non-null    object
 1   ManufactProduct  303 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.9+ KB

In [334]:
manuprod.isna().sum()

시점                 0
ManufactProduct    0
dtype: int64

### USRP

In [335]:
# USRP 컬럼 자료형 float로 바꾸기
usrp['USRP'] = usrp['USRP'].astype('float')

In [336]:
usrp

              시점     USRP
0     2002-12-18  30000.0
1     2002-12-25  37250.0
2     2003-01-01  39500.0
3     2003-01-08  33750.0
4     2003-01-15  30000.0
...          ...      ...
1033  2022-10-05      0.0
1034  2022-10-12      0.0
1035  2022-10-19     10.0
1036  2022-10-26      1.0
1037  2022-11-02      1.0

[1038 rows x 2 columns]

In [337]:
usrp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1038 entries, 0 to 1037
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   시점      1038 non-null   object
 1   USRP    1038 non-null   float64
dtypes: float64(1), object(1)
memory usage: 16.3+ KB

In [338]:
usrp.isna().sum()

시점      0
USRP    0
dtype: int64

## 저장

In [339]:
# transdata_temp에 저장
path = 'C:/Users/USER/Desktop/transdata/transdata_temp'

call.to_csv(os.path.join(path, 'Call.csv'), index=False, encoding='cp949')
interestdiff.to_csv(os.path.join(path, 'InterestDiff.csv'), index=False, encoding='cp949')
vkospi.to_csv(os.path.join(path, 'VKOSPI.csv'), index=False, encoding='cp949')
tradbal.to_excel(os.path.join(path, 'TradeBalance.xlsx'), index=False)
cpi.to_excel(os.path.join(path, 'CPI.xlsx'), index=False)
ppi.to_csv(os.path.join(path, 'PPI.csv'), index=False, encoding='cp949')
unemploy.to_excel(os.path.join(path, 'Unemployment.xlsx'), index=False)
manuprod.to_excel(os.path.join(path, 'ManufactProduct.xlsx'), index=False)

korp.to_csv(os.path.join(path, 'KORP.csv'), index=False, encoding='cp949')
usrp.to_csv(os.path.join(path, 'USRP.csv'), index=False, encoding='cp949')